Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_dfsdm.h
// CH4AWSCDR Configuration

#define DFSDM_CH4AWSCDR_SCDT        (0xFFU<<0)
#define DFSDM_CH4AWSCDR_SCDT_0      (0x1U<<0)
#define DFSDM_CH4AWSCDR_BKSCD       (0xFU<<12)
#define DFSDM_CH4AWSCDR_BKSCD_0     (0x1U<<12)
#define DFSDM_CH4AWSCDR_AWFOSR      (0x1FU<<16)
#define DFSDM_CH4AWSCDR_AWFOSR_0    (0x1U<<16)
#define DFSDM_CH4AWSCDR_AWFORD      (0x3U<<22)
#define DFSDM_CH4AWSCDR_AWFORD_0    (0x1U<<22)

// CH4WDATR Configuration

#define DFSDM_CH4WDATR_WDATA        (0xFFFFU<<0)
#define DFSDM_CH4WDATR_WDATA_0      (0x1U<<0)

// CH4DATINR Configuration

#define DFSDM_CH4DATINR_INDAT0      (0xFFFFU<<0)
#define DFSDM_CH4DATINR_INDAT0_0    (0x1U<<0)
#define DFSDM_CH4DATINR_INDAT1      (0xFFFFU<<16)
#define DFSDM_CH4DATINR_INDAT1_0    (0x1U<<16)

// CH4DLYR Configuration

#define DFSDM_CH4DLYR_PLSSKP        (0x3FU<<0)
#define DFSDM_CH4DLYR_PLSSKP_0      (0x1U<<0)

// CH5CFGR1 Configuration

#define DFSDM_CH5CFGR1_SITP         (0x3U<<0)
#define DFSDM_CH5CFGR1_SITP_0       (0x1U<<0)
#define DFSDM_CH5CFGR1_SPICKSEL     (0x3U<<2)
#define DFSDM_CH5CFGR1_SPICKSEL_0   (0x1U<<2)
#define DFSDM_CH5CFGR1_SCDEN        (0x1U<<5)
#define DFSDM_CH5CFGR1_CKABEN       (0x1U<<6)
#define DFSDM_CH5CFGR1_CHEN         (0x1U<<7)
#define DFSDM_CH5CFGR1_CHINSEL      (0x1U<<8)
#define DFSDM_CH5CFGR1_DATMPX       (0x3U<<12)
#define DFSDM_CH5CFGR1_DATMPX_0     (0x1U<<12)
#define DFSDM_CH5CFGR1_DATPACK      (0x3U<<14)
#define DFSDM_CH5CFGR1_DATPACK_0    (0x1U<<14)

// CH5CFGR2 Configuration

#define DFSDM_CH5CFGR2_DTRBS        (0x1FU<<3)
#define DFSDM_CH5CFGR2_DTRBS_0      (0x1U<<3)
#define DFSDM_CH5CFGR2_OFFSET       (0xFFFFFFU<<8)
#define DFSDM_CH5CFGR2_OFFSET_0     (0x1U<<8)

// CH5AWSCDR Configuration

#define DFSDM_CH5AWSCDR_SCDT        (0xFFU<<0)
#define DFSDM_CH5AWSCDR_SCDT_0      (0x1U<<0)
#define DFSDM_CH5AWSCDR_BKSCD       (0xFU<<12)
#define DFSDM_CH5AWSCDR_BKSCD_0     (0x1U<<12)
#define DFSDM_CH5AWSCDR_AWFOSR      (0x1FU<<16)
#define DFSDM_CH5AWSCDR_AWFOSR_0    (0x1U<<16)
#define DFSDM_CH5AWSCDR_AWFORD      (0x3U<<22)
#define DFSDM_CH5AWSCDR_AWFORD_0    (0x1U<<22)

// CH5WDATR Configuration

#define DFSDM_CH5WDATR_WDATA        (0xFFFFU<<0)
#define DFSDM_CH5WDATR_WDATA_0      (0x1U<<0)

// CH5DATINR Configuration

#define DFSDM_CH5DATINR_INDAT0      (0xFFFFU<<0)
#define DFSDM_CH5DATINR_INDAT0_0    (0x1U<<0)
#define DFSDM_CH5DATINR_INDAT1      (0xFFFFU<<16)
#define DFSDM_CH5DATINR_INDAT1_0    (0x1U<<16)

// CH5DLYR Configuration

#define DFSDM_CH5DLYR_PLSSKP        (0x3FU<<0)
#define DFSDM_CH5DLYR_PLSSKP_0      (0x1U<<0)

// CH6CFGR1 Configuration

#define DFSDM_CH6CFGR1_SITP         (0x3U<<0)
#define DFSDM_CH6CFGR1_SITP_0       (0x1U<<0)
#define DFSDM_CH6CFGR1_SPICKSEL     (0x3U<<2)
#define DFSDM_CH6CFGR1_SPICKSEL_0   (0x1U<<2)
#define DFSDM_CH6CFGR1_SCDEN        (0x1U<<5)
#define DFSDM_CH6CFGR1_CKABEN       (0x1U<<6)
#define DFSDM_CH6CFGR1_CHEN         (0x1U<<7)
#define DFSDM_CH6CFGR1_CHINSEL      (0x1U<<8)
#define DFSDM_CH6CFGR1_DATMPX       (0x3U<<12)
#define DFSDM_CH6CFGR1_DATMPX_0     (0x1U<<12)
#define DFSDM_CH6CFGR1_DATPACK      (0x3U<<14)
#define DFSDM_CH6CFGR1_DATPACK_0    (0x1U<<14)

// CH6CFGR2 Configuration

#define DFSDM_CH6CFGR2_DTRBS        (0x1FU<<3)
#define DFSDM_CH6CFGR2_DTRBS_0      (0x1U<<3)
#define DFSDM_CH6CFGR2_OFFSET       (0xFFFFFFU<<8)
#define DFSDM_CH6CFGR2_OFFSET_0     (0x1U<<8)

// CH6AWSCDR Configuration

#define DFSDM_CH6AWSCDR_SCDT        (0xFFU<<0)
#define DFSDM_CH6AWSCDR_SCDT_0      (0x1U<<0)
#define DFSDM_CH6AWSCDR_BKSCD       (0xFU<<12)
#define DFSDM_CH6AWSCDR_BKSCD_0     (0x1U<<12)
#define DFSDM_CH6AWSCDR_AWFOSR      (0x1FU<<16)
#define DFSDM_CH6AWSCDR_AWFOSR_0    (0x1U<<16)
#define DFSDM_CH6AWSCDR_AWFORD      (0x3U<<22)
#define DFSDM_CH6AWSCDR_AWFORD_0    (0x1U<<22)

// CH6WDATR Configuration

#define DFSDM_CH6WDATR_WDATA        (0xFFFFU<<0)
#define DFSDM_CH6WDATR_WDATA_0      (0x1U<<0)

// CH6DATINR Configuration

#define DFSDM_CH6DATINR_INDAT0      (0xFFFFU<<0)
#define DFSDM_CH6DATINR_INDAT0_0    (0x1U<<0)
#define DFSDM_CH6DATINR_INDAT1      (0xFFFFU<<16)
#define DFSDM_CH6DATINR_INDAT1_0    (0x1U<<16)

// CH6DLYR Configuration

#define DFSDM_CH6DLYR_PLSSKP        (0x3FU<<0)
#define DFSDM_CH6DLYR_PLSSKP_0      (0x1U<<0)

// CH7CFGR1 Configuration

#define DFSDM_CH7CFGR1_SITP         (0x3U<<0)
#define DFSDM_CH7CFGR1_SITP_0       (0x1U<<0)
#define DFSDM_CH7CFGR1_SPICKSEL     (0x3U<<2)
#define DFSDM_CH7CFGR1_SPICKSEL_0   (0x1U<<2)
#define DFSDM_CH7CFGR1_SCDEN        (0x1U<<5)
#define DFSDM_CH7CFGR1_CKABEN       (0x1U<<6)
#define DFSDM_CH7CFGR1_CHEN         (0x1U<<7)
#define DFSDM_CH7CFGR1_CHINSEL      (0x1U<<8)
#define DFSDM_CH7CFGR1_DATMPX       (0x3U<<12)
#define DFSDM_CH7CFGR1_DATMPX_0     (0x1U<<12)
#define DFSDM_CH7CFGR1_DATPACK      (0x3U<<14)
#define DFSDM_CH7CFGR1_DATPACK_0    (0x1U<<14)

// CH7CFGR2 Configuration

#define DFSDM_CH7CFGR2_DTRBS        (0x1FU<<3)
#define DFSDM_CH7CFGR2_DTRBS_0      (0x1U<<3)
#define DFSDM_CH7CFGR2_OFFSET       (0xFFFFFFU<<8)
#define DFSDM_CH7CFGR2_OFFSET_0     (0x1U<<8)

// CH7AWSCDR Configuration

#define DFSDM_CH7AWSCDR_SCDT        (0xFFU<<0)
#define DFSDM_CH7AWSCDR_SCDT_0      (0x1U<<0)
#define DFSDM_CH7AWSCDR_BKSCD       (0xFU<<12)
#define DFSDM_CH7AWSCDR_BKSCD_0     (0x1U<<12)
#define DFSDM_CH7AWSCDR_AWFOSR      (0x1FU<<16)
#define DFSDM_CH7AWSCDR_AWFOSR_0    (0x1U<<16)
#define DFSDM_CH7AWSCDR_AWFORD      (0x3U<<22)
#define DFSDM_CH7AWSCDR_AWFORD_0    (0x1U<<22)

// CH7WDATR Configuration

#define DFSDM_CH7WDATR_WDATA        (0xFFFFU<<0)
#define DFSDM_CH7WDATR_WDATA_0      (0x1U<<0)

// CH7DATINR Configuration

#define DFSDM_CH7DATINR_INDAT0      (0xFFFFU<<0)
#define DFSDM_CH7DATINR_INDAT0_0    (0x1U<<0)
#define DFSDM_CH7DATINR_INDAT1      (0xFFFFU<<16)
#define DFSDM_CH7DATINR_INDAT1_0    (0x1U<<16)

// CH7DLYR Configuration

#define DFSDM_CH7DLYR_PLSSKP        (0x3FU<<0)
#define DFSDM_CH7DLYR_PLSSKP_0      (0x1U<<0)

// FLT0CR1 Configuration

#define DFSDM_FLT0CR1_DFEN          (0x1U<<0)
#define DFSDM_FLT0CR1_JSWSTART      (0x1U<<1)
#define DFSDM_FLT0CR1_JSYNC         (0x1U<<3)
#define DFSDM_FLT0CR1_JSCAN         (0x1U<<4)
#define DFSDM_FLT0CR1_JDMAEN        (0x1U<<5)
#define DFSDM_FLT0CR1_JEXTSEL       (0x7U<<8)
#define DFSDM_FLT0CR1_JEXTSEL_0     (0x1U<<8)
#define DFSDM_FLT0CR1_JEXTEN        (0x3U<<13)
#define DFSDM_FLT0CR1_JEXTEN_0      (0x1U<<13)
#define DFSDM_FLT0CR1_RSWSTART      (0x1U<<17)
#define DFSDM_FLT0CR1_RCONT         (0x1U<<18)
#define DFSDM_FLT0CR1_RSYNC         (0x1U<<19)
#define DFSDM_FLT0CR1_RDMAEN        (0x1U<<21)
#define DFSDM_FLT0CR1_RCH           (0x7U<<24)
#define DFSDM_FLT0CR1_RCH_0         (0x1U<<24)
#define DFSDM_FLT0CR1_FAST          (0x1U<<29)
#define DFSDM_FLT0CR1_AWFSEL        (0x1U<<30)

// FLT0CR2 Configuration

